
So I now have a Retina MacBook Pro, named iris after Iris Murdoch.  All my laptops have been named after 20th/21st century philosophers: 

| name    | philosopher         | machine             |
|---------+---------------------+---------------------|
| gottlob | Gottlob Frege       | IBM Thinkpad        |
| ludwig  | Ludwig Wittgenstein | PowerBook G4        |
| bert    | Bertrand Russell    | MacBook Pro         |
| willard | W. V. O. Quine      | iMac                |
| slavoj  | Slavoj Žižek        | MacBook Pro unibody |
| iris    | Iros Murdoch        | Retina MacBook Pro  |
|         |                     |                     |

*** rsync
+ OS X already has rsync, but it is version 2.6.9 from 2008!
  + In particular, it doesn't copy extended attributes properly
  + This is important since I don't want to lose any metadata when I copy over files from my old laptop.
+ So I install the latest version via homebrew:
  #+BEGIN_SRC sh
brew tap homebrew/dupes
brew info libiconv
brew install homebrew/dupes/libiconv
brew install homebrew/dupes/rsync
  #+END_SRC
+ Note that to use it, it is necessary to give the full path, since =/usr/bin= is before =/usr/local/bin= in y =$PATH=
  #+BEGIN_SRC sh :results verbatim 
rsync --version
  #+END_SRC

  #+RESULTS:
  #+BEGIN_EXAMPLE
  rsync  version 2.6.9  protocol version 29
  Copyright (C) 1996-2006 by Andrew Tridgell, Wayne Davison, and others.
  <http://rsync.samba.org/>
  Capabilities: 64-bit files, socketpairs, hard links, symlinks, batchfiles,
                inplace, IPv6, 64-bit system inums, 64-bit internal inums
  
  rsync comes with ABSOLUTELY NO WARRANTY.  This is free software, and you
  are welcome to redistribute it under certain conditions.  See the GNU
  General Public Licence for details.
  #+END_EXAMPLE
 
  #+BEGIN_SRC sh :results verbatim 
/usr/local/bin/rsync --version
  #+END_SRC

  #+RESULTS:
  #+begin_example
  rsync  version 3.0.9  protocol version 30
  Copyright (C) 1996-2011 by Andrew Tridgell, Wayne Davison, and others.
  Web site: http://rsync.samba.org/
  Capabilities:
      64-bit files, 64-bit inums, 64-bit timestamps, 64-bit long ints,
      socketpairs, hardlinks, symlinks, IPv6, batchfiles, inplace,
      append, ACLs, xattrs, iconv, symtimes, file-flags

  rsync comes with ABSOLUTELY NO WARRANTY.  This is free software, and you
  are welcome to redistribute it under certain conditions.  See the GNU
  General Public Licence for details.
  #+end_example


